{
    "skills": [
        {
            "title": "Html",
            "text": "Mantenho o uso nos meus estudos. Acredito que uma base de conhecimento sólida sobre a forma como a web é construída pode tornar-me um desenvolvedor muito mais preciso e confiante quando o assunto é desenvolvimento web."
        },
        {
            "title": "CSS",
            "text": "Sem dúvida, uma ferramenta essencial para o desenvolvedor Front-End. Mesmo utilizando bibliotecas ou pré-processadores de CSS, mantenho o hábito de fazer pesquisa diretamente na fonte da estilização da web em sua documentação."
        },
        {
            "title": "JavaScript",
            "text": "Até o momento, este tem sido o meu maior foco sendo desenvolvedor. Busco sempre implementar o JavaScript no meu dia a dia para solucionar desde tarefas simples até algo mais complexo."
        },
        {
            "title": "TypeScript",
            "text": "Utilizei algumas vezes em projetos profissionais desenvolvidos em React.js e Angular nos quais havia a necessidade de tipar o JavaScript para desenvolver um código mais robusto e escalável. Sigo estudando."
        },
        {
            "title": "React.js",
            "text": "Utilizei em projetos pessoais e profissionais junto ao TypeScript. Foi a minha primeira escolha ao decidir buscar mais eficiência no desenvolvimento de sistemas mais complexos."
        },
        {
            "title": "Styled-components",
            "text": "Busco sempre fazer uso de styled-components quando necessário para desenvolver uma arquitetura mais robusta em React.js."
        },
        {
            "title": "Angular",
            "text": "Tratando-se de projetos reais para empresas, esta tem sido a tecnologia com a qual tive contato por mais tempo, utilizada no desenvolvimento de um sistema interno para uma startup que atua na área de seguros."
        },
        {
            "title": "SCSS",
            "text": "Pré-processador de CSS utilizado junto ao framework Angular. Utilizei durante o período em que participei do desenvolvimento do sistema interno de uma startup que atua na área de seguros."
        }
    ],
    "experiences": [
        {
            "cargo": "Front end",
            "empresa": "Bem Protegido",
            "temp": "19-09-2022 | 10-08-2023",
            "description": "Como desenvolvedor Front-end, fui responsável pela implementação dos designs de uma aplicação corporativa, garantindo uma experiência visual intuitiva para os usuários ao acessarem serviços, informações de cadastro e detalhes sobre planos contratados.",
            "skills": "Angular | TypeScript | SCSS"
        }
    ],
    "academics":[
        {
            "institution":"Centro Universitario Unifacvest",
            "course": "Ciência da Computação",
            "temp": "01-02-2021 | 01-12-2025"
        }
    ]
}